app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "poonam"], ["body", "my post!"], ["post_id", 3], ["created_at", "2018-09-10 01:13:11.598619"], ["updated_at", "2018-09-10 01:13:11.598619"]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(comment_params)