app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Post five"], ["body", "this is post five"], ["created_at", "2018-09-10 02:17:31.623142"], ["updated_at", "2018-09-10 02:17:31.623142"]]
---
	def create
		#render plain: params[:post].inspect
		#@post is a variable
		#Post is the model name
		#params from the post request i.e params[:post] - this causes forbidden error
		#so we create another method that permits the parameters access and pass that metjhod name here


		@post = Post.new(post_params)

		#load the show view
		if(@post.save)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Posting second time"], ["updated_at", "2018-09-10 02:18:04.402599"], ["id", 3]]
---
	def update
		@post = Post.find(params[:id])

		if(@post.update(post_params))